WebPage/docs/posts/drafts/31052021_emacs_portable.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs Portable</title>
<meta name="generator" content="Org mode" />
<meta name="description" content="DRAFT"
 />
</head>
<body>
<div id="content">
<h1 class="title">Emacs Portable</h1>

<div id="outline-container-org7c2298b" class="outline-2">
<h2 id="emacs-portable">Emacs Portable</h2>
<div class="outline-text-2" id="text-emacs-portable">
</div>
<div id="outline-container-org1ab199c" class="outline-3">
<h3 id="motivaci-n">Motivación</h3>
<div class="outline-text-3" id="text-motivaci-n">
<p>
  Siempre he querido usar EMACS en mi ordenador, pero es muy grande e incómodo para escribir (al menos en el autobús) por lo que decidí comprarme un ordenador pequeño, los viejos "netbooks" o algo un poco más mordeno que no superara las 14", fue un fracaso total y me negaba a instalar EMACS en mi ordenador porque Windows es tapar un agujero tras otro, que no digo que EMACS en un pendrive no lo sea pero al menos puedes llevarlo a todas partes, beneficiarte del hardware de cualquier ordenador y sobre todo usarlo en la universidad, así evitaba llevar mi portátil si lo necesitaba para algo.  
Nota: Estoy escribiendo esto desde mientras voy en el metro, en mi portátil incómodo con mi emacs portable.  
</p>
</div>
</div>
<div id="outline-container-orgc490946" class="outline-3">
<h3 id="ventajas-y-desventajas">Ventajas y desventajas</h3>
<div class="outline-text-3" id="text-ventajas-y-desventajas">
</div>
<div id="outline-container-org3747cb0" class="outline-4">
<h4 id="ventajas">Ventajas</h4>
<div class="outline-text-4" id="text-ventajas">
<ul class="org-ul">
<li>Evidentemente portabilidad.</li>
<li>Rapidez frente a instalar EMACS desde linux portable.</li>
</ul>
</div>
</div>
<div id="outline-container-org7e08fe1" class="outline-4">
<h4 id="desventajas">Desventajas</h4>
<div class="outline-text-4" id="text-desventajas">
<ul class="org-ul">
<li>Solo funciona en sistemas Windows.</li>
<li>Fácil de perder, necesita de backups o en su defecto tener una copia fija instalada y todos los cambios copiarlos en el pendrive.
<ul class="org-ul">
<li>Además de virus y software malicioso que puede causarnos grandes problemas.</li>
</ul></li>
<li>EMACS portable es símbolo de compiladores y software extra portables, no es posible tenerlo todo.
<ul class="org-ul">
<li>Es posible que tu mejor aliado en esta travesía sea <a href="https://portableapps.com/">https://portableapps.com/</a>.</li>
</ul></li>
</ul>
<p>
Aunque las desventajas sean mayores que las ventajas, me parece algo útil  además de interesante,ya que puede sacarnos de un apuro, <b>no lo recomiendo para un uso diario y continuo</b>.
</p>
</div>
</div>
</div>
<div id="outline-container-orgc7980d5" class="outline-3">
<h3 id="sobre-el-hardware">Sobre el hardware</h3>
<div class="outline-text-3" id="text-sobre-el-hardware">
<p>
Para esta tarea he usado un pendrive clásico, <b>Kingston de 16Gb</b>, no tiene botón antiescritura ni cifrado ni nada parecido.
<a href="blue">#Adjuntar foto</a>
</p>
</div>
</div>
<div id="outline-container-orgee58f5e" class="outline-3">
<h3 id="sobre-el-software">Sobre el software</h3>
<div class="outline-text-3" id="text-sobre-el-software">
</div>
<div id="outline-container-org14a7f4d" class="outline-4">
<h4 id="c-mo-empezar">¿Cómo empezar?</h4>
<div class="outline-text-4" id="text-c-mo-empezar">
<p>
Para empezar debemos descargar los binarios de EMACS en &#x2026;, los metemos en un pendrive y listo ya es portable&#x2026; Ahora debemos asegurarnos de que funcione desde el pendrive para esto debemos cambiar el <b>HOME</b> que se hace con un pequeño script en batch.
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="font-weight: bold;">set</span> <span style="font-weight: bold; font-style: italic;">HOME</span>=%~dp0..<span style="font-style: italic;">\.</span>.\emacshome
<span style="font-style: italic;">"%~dp0runemacs.exe"</span> %*
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org969417d" class="outline-3">
<h3 id="referencias">Referencias</h3>
<div class="outline-text-3" id="text-referencias">
<ul class="org-ul">
<li><a href="https://www.emacswiki.org/emacs/EmacsPortableApp">https://www.emacswiki.org/emacs/EmacsPortableApp</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org78f8e3e" class="outline-2">
<h2 id="c-digo-test">Código test</h2>
<div class="outline-text-2" id="text-c-digo-test">
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">a</span> = 2+3
<span style="font-weight: bold;">print</span>(<span style="font-style: italic;">"Hello World, I am in python"</span>, a)
</pre>
</div>


<div class="org-src-container">
<pre class="src src-octave">n <span style="font-weight: bold;">=</span> [1<span style="font-weight: bold;">:</span>10]<span style="font-weight: bold;">;</span>
x <span style="font-weight: bold;">=</span> 5<span style="font-weight: bold;">*</span>n<span style="font-weight: bold;">+</span>15000<span style="font-weight: bold;">;</span>
ans <span style="font-weight: bold;">=</span> x
</pre>
</div>


<div class="org-src-container">
<pre class="src src-spice">RC circuit
r1 1 0 10k
c1 1 0 1p

.IC V(1)=1
.tran 1n 0.1u
.end

.control
run
set gnuplot_terminal=eps/quit
gnuplot nombre v(1)
.endc
</pre>
</div>


<div class="org-src-container">
<pre class="src src-octave">gain<span style="font-weight: bold;">=-</span>10<span style="font-weight: bold;">;</span>
r1<span style="font-weight: bold;">=</span>10e3<span style="font-weight: bold;">;</span>
r2 <span style="font-weight: bold;">=</span> <span style="font-weight: bold;">-</span>gain<span style="font-weight: bold;">*</span>r1<span style="font-weight: bold;">;</span>
ans <span style="font-weight: bold;">=</span> [gain<span style="font-weight: bold;">,</span> r1<span style="font-weight: bold;">,</span> r2]<span style="font-weight: bold;">;</span>
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">-10</td>
<td class="org-right">10000</td>
<td class="org-right">100000</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</body>
</html>
